Repository: LazariaInk/ghost-chat
Catalog: lib/l10n/app_*.arb
Languages: ro

source: Settings
ro: Setări

source: Notifications
ro: Notificări

source: Dark Theme
ro: Tema întunecată

source: Terms and Conditions
ro: Termeni și condiții

source: Select Language
ro: Selectează Limba

source: Sign in
ro: Сonectare

source: Channels
ro: Canale

source: Write a message...
ro: Scrie un mesaj...

source: Error decrypting message:
ro: Eroare la decriptare

# errorSendMessage
source: Error on send message
ro: Eroare la trimiterea mesajului

source: Confirm deletion
ro: Confirmare ștergere

# confirmDeletionMessage
source: To delete the channel, write "DELETE" in the field below:
ro: Pentru a șterge canalul, scrieți "DELETE" în câmpul de mai jos:

# confirmDeletionToolkit
source: write "DELETE"
ro: scrieți "DELETE"

source: cancel
ro: anulează

source: Delete
ro: Șterge

# searchChannel
source: Search a channel...
ro: Caută un canal...

source: Add channel
ro: Adaugă un canal

# channelName
source: Channel's name
ro: Numele canalului

source: Secret key
ro: Cheia secretă

source: Encryption algorithm
ro: Algoritmul de criptare

# createChannelTab
source: Create channel
ro: creeaza un canal

# connectingToAChannelTab
source: Connecting to a channel
ro: Conectează-te la canal

# addChannelErrorMessage
source: Add channel fail
ro: Eroare la adaugarea canalului

# checkConnectionMessage
source: Check connection
ro: Verificați conecțiunea

# secretKeyLabel
source: Secret key
ro: Cheia secretă

# addChannelAllFieldsReqMessage
source: Channel name and encryption key are required.
ro: Numele canalului și cheia de criptare sunt necesare.

# connectingChannelAllFieldsReqMessage
source: All fields are required.
ro: Toate câmpurile sunt necesare.

# errorOnChannelConnection
source: An error occurred connecting to the channel.
ro: A apărut o eroare la conectarea la canal.

# connectingButton
source: Sign in
ro: conectează-te

source: Connection success
ro: Conecțiune reușită
